problem_1_1 = ("Биссектриса внешнего угла при вершине C треугольника "
               "ABC пересекает описанную окружность в точке D. Докажите, "
               "что AD = BD.")

problem_1_2 = ("Две окружности пересекаются в точках A и B. Точка X лежит на прямой "
               "AB, но не на отрезке AB. Докажите, что длины всех касательных, "
               "проведенных из точки X к окружностям, равны.")

problem_1_3 = ("ABCD — параллелограмм, M — середина AF, N — середина CE, где E и F лежат на "
               "CD и AD соотвтственно. Доказать, что если B, M и E на одной прямой, то и B, "
               "N, F тоже на одной прямой.")

problem_2_1 = ("Точка HI — ортоцентр треугольника A1BC и центр вписанной окружности треугольника "
               "A2BC. O — центр описанной окружности треугольника A1BC. A2 такова, что HI - "
               "центр вписанной окружности треугольника A2BC. Докажите, что A1A2, OHI и BC "
               "пересекаются в одной точке.")

problem_3_1 = ("Дан описанный четырехугольник ABCD, в котором диагональ AC не является "
               "биссектрисой угла С. На этой биссектрисе отмечена точка E, такая, что AE и "
               "BD перпендикулярны. Точка F — основание перпендикуляра, опущенного из точки "
               "E на сторону BC. Докажите, что AB=BF.")

problem_3_2 = ("Две окружности касаются внешним образом в точке A. На их общей внешней "
               "касательной выбрана точка D. Из точки D проведена касательная DB к первой "
               "окружности, пересекающая вторую в точке C. Докажите, что окружность (ABC) "
               "касается прямой, соединяющей D с центром первой окружности.")
