solution_1_1 = ("Отметим на продолжении AC за точку C точку X. Заметим, что: "
                "уг ABD = уг ACD = (уг BCX) / 2 = 180 - уг BCD = уг BAD. "
                "То есть треугольник ABD - равнобедренный, и AD = BD.")

solution_1_2 = ("По теореме о квадрате касательной квадрат каждого из отрезков "
                "касательных, проведённых из точки X к данным окружностям, равен XA * XB.")

solution_1_3 = ("Проведём через точку F, прямую параллельную AB, ее пересечение с ВС это Т. "
                "Пересечение с ВМ это К. Тогда легко заметить что МF- паралельно BT, и равно "
                "его половине. Следовательно MF- средняя линия ТК, тогда по замечательному "
                "свойству трапеции В, N, F лежат на одной прямой")

solution_2_1 = ("Заметим, что A1O параллельно A2HI; Также BA1 и BHI изогонали относительно <A2BO. "
                "Тогда теорема об изогоналях завершает задачу")

solution_3_1 = ("Отметим на CD т. G: AD=DG. Тогда FC=CG, поэтому выполнена "
                "теорема Карно для BCD, AFG.")

solution_3_2 = ("Сделаем инверсию в точке А. Тогда окружности станут параллельными прямыми. "
                "Окружность (ABC) станет прямой BC, а прямая DO станет окружностью, проходящей "
                "через D и A, центр которой лежит на BQ. Покажем, что такая окр касается BC. "
                "X и Y - пересечение PQ с BC и BE. Заметим, что отношения степеней точек X и Y "
                "относительно зел. и син. окр равны => по лемме о соосных окружностях (XYAD) - "
                "вписанный. Но O1O2 и BQ - серперы к AD и XY => S (их пересечение) - центр (XYAD) "
                "=> уг SXB = 90 => (XYAD) касается BC. Остается только осознать, что эта "
                "окружность (XYAD) нам подходит. В самом деле, ведь она проходит через A и "
                "D, а ее центр лежит на BQ. Отдельно стоит пояснить почему уг SXB = 90. SQ*SB "
                "= SD^2 = SX^2 => SX/SQ = SB/SX => треуги SXQ и SBX - подобны => уг SXB = "
                "уг SQX = 90")
